import React from 'react';
import { SubmitErrorHandler, SubmitHandler, useForm } from 'react-hook-form';
import { Link } from 'react-router-dom';

interface LoginForm {
  email: string;
  password: string;
}

export const Login = () => {
  const [valueEmail, setValueEmail] = React.useState('');
  const [valuePassword, setValuePassword] = React.useState('');

  const [passwordEye, setPasswordEye] = React.useState(false);

  const handlePasswordClick = () => {
    setPasswordEye(!passwordEye);
  };

  const onChangeInputEmail = (event: React.ChangeEvent<HTMLInputElement>) => {
    setValueEmail(event.target.value);
  };

  const onChangeInputPassword = (
    event: React.ChangeEvent<HTMLInputElement>
  ) => {
    setValuePassword(event.target.value);
  };

  const {
    register,
    handleSubmit,
    formState: { errors, isValid },
    reset,
    resetField,
  } = useForm<LoginForm>({
    mode: 'onChange',
  });

  const onSubmit: SubmitHandler<LoginForm> = (data) => {
    console.log(data);
    reset();
  };

  const error: SubmitErrorHandler<LoginForm> = (data) => {
    console.log(data);
  };

  return (
    <div className="container">
      <div className="login">
        <form onSubmit={handleSubmit(onSubmit, error)}>
          <h3>Авторизация</h3>
          <div className="login__item login__email">
            <label>Электронная почта</label>
            <input
              {...register('email', {
                required: true,
                pattern: {
                  value:
                    /^((([0-9A-Za-z]{1}[-0-9A-z\.]{1,}[0-9A-Za-z]{1})|([0-9А-Яа-я]{1}[-0-9А-я\.]{1,}[0-9А-Яа-я]{1}))@([-A-Za-z]{1,}\.){1,2}[-A-Za-z]{2,})$/u,
                  message: 'Текст ошибки',
                },
              })}
              value={valueEmail}
              onChange={onChangeInputEmail}
              type="text"
              placeholder="example@mail.ru"
              aria-invalid={errors.email ? true : false}
            />
            {errors.email && (
              <div style={{ color: '#f46666' }}>{errors.email.message}</div>
            )}
          </div>
          <div className="login__item login__password">
            <label>Пароль</label>
            <input
              {...register('password')}
              value={valuePassword}
              onChange={onChangeInputPassword}
              type="password"
              placeholder="Введите 8 значный пароль"
            />
            {errors.password && (
              <div style={{ color: '#f46666' }}>{errors.password.message}</div>
            )}
            {valuePassword && (
              <div className="login__block-icon">
                <svg
                  onClick={handlePasswordClick}
                  width="20"
                  height="20"
                  viewBox="0 0 20 20"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_9419_9489)">
                    <path
                      d="M19.3923 7.84977C18.64 6.61788 17.6911 5.51749 16.5831 4.59227L18.9165 2.25894C19.0683 2.10177 19.1523 1.89127 19.1504 1.67277C19.1485 1.45427 19.0608 1.24526 18.9063 1.09076C18.7518 0.936251 18.5428 0.84861 18.3243 0.846711C18.1058 0.844813 17.8953 0.928808 17.7381 1.08061L15.2006 3.62144C13.6276 2.68712 11.8293 2.20016 9.9998 2.21311C4.84063 2.21311 1.90063 5.74477 0.607299 7.84977C0.207739 8.49603 -0.00390625 9.24081 -0.00390625 10.0006C-0.00390625 10.7604 0.207739 11.5052 0.607299 12.1514C1.3596 13.3833 2.30854 14.4837 3.41647 15.4089L1.08313 17.7423C1.00354 17.8191 0.940055 17.9111 0.896381 18.0128C0.852707 18.1144 0.829718 18.2238 0.828757 18.3344C0.827795 18.4451 0.84888 18.5548 0.890781 18.6572C0.932681 18.7597 0.994559 18.8527 1.0728 18.9309C1.15105 19.0092 1.24409 19.0711 1.3465 19.113C1.44892 19.1549 1.55865 19.1759 1.6693 19.175C1.77995 19.174 1.8893 19.151 1.99097 19.1074C2.09264 19.0637 2.18459 19.0002 2.26147 18.9206L4.8048 16.3773C6.37586 17.3114 8.17203 17.7992 9.9998 17.7881C15.159 17.7881 18.099 14.2564 19.3923 12.1514C19.7919 11.5052 20.0035 10.7604 20.0035 10.0006C20.0035 9.24081 19.7919 8.49603 19.3923 7.84977ZM2.0273 11.2789C1.78991 10.8948 1.66417 10.4522 1.66417 10.0006C1.66417 9.54905 1.78991 9.1064 2.0273 8.72227C3.13897 6.91727 5.65147 3.87977 9.9998 3.87977C11.3834 3.87202 12.7475 4.20547 13.9715 4.85061L12.294 6.52811C11.4939 5.99694 10.5347 5.75894 9.57916 5.85448C8.6236 5.95002 7.73052 6.37322 7.05147 7.05228C6.37241 7.73133 5.94921 8.62441 5.85367 9.57997C5.75813 10.5355 5.99613 11.4947 6.5273 12.2948L4.6023 14.2198C3.58155 13.3945 2.7105 12.3997 2.0273 11.2789ZM12.4998 10.0006C12.4998 10.6636 12.2364 11.2995 11.7676 11.7684C11.2987 12.2372 10.6628 12.5006 9.9998 12.5006C9.62856 12.4992 9.26247 12.4137 8.92897 12.2506L12.2498 8.92977C12.4129 9.26327 12.4984 9.62937 12.4998 10.0006ZM7.4998 10.0006C7.4998 9.33757 7.76319 8.70168 8.23203 8.23284C8.70087 7.764 9.33676 7.50061 9.9998 7.50061C10.371 7.50204 10.7371 7.58751 11.0706 7.75061L7.7498 11.0714C7.58671 10.7379 7.50124 10.3718 7.4998 10.0006ZM17.9723 11.2789C16.8606 13.0839 14.3481 16.1214 9.9998 16.1214C8.61624 16.1292 7.2521 15.7957 6.02813 15.1506L7.70563 13.4731C8.50569 14.0043 9.46488 14.2423 10.4204 14.1467C11.376 14.0512 12.2691 13.628 12.9481 12.9489C13.6272 12.2699 14.0504 11.3768 14.1459 10.4212C14.2415 9.46568 14.0035 8.5065 13.4723 7.70644L15.3973 5.78144C16.418 6.60667 17.2891 7.60148 17.9723 8.72227C18.2097 9.1064 18.3354 9.54905 18.3354 10.0006C18.3354 10.4522 18.2097 10.8948 17.9723 11.2789Z"
                      fill="#0B1332"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_9419_9489">
                      <rect width="20" height="20" fill="white" />
                    </clipPath>
                  </defs>
                </svg>

                <svg
                  onClick={handlePasswordClick}
                  width="20"
                  height="20"
                  viewBox="0 0 20 20"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <g clip-path="url(#clip0_9419_9487)">
                    <path
                      d="M19.3923 7.84956C18.0998 5.74456 15.1598 2.21289 9.9998 2.21289C4.8398 2.21289 1.8998 5.74456 0.607299 7.84956C0.207739 8.49581 -0.00390625 9.24059 -0.00390625 10.0004C-0.00390625 10.7602 0.207739 11.505 0.607299 12.1512C1.8998 14.2562 4.8398 17.7879 9.9998 17.7879C15.1598 17.7879 18.0998 14.2562 19.3923 12.1512C19.7919 11.505 20.0035 10.7602 20.0035 10.0004C20.0035 9.24059 19.7919 8.49581 19.3923 7.84956ZM17.9715 11.2787C16.8615 13.0837 14.349 16.1212 9.9998 16.1212C5.65063 16.1212 3.13813 13.0837 2.02813 11.2787C1.79074 10.8946 1.66501 10.452 1.66501 10.0004C1.66501 9.54883 1.79074 9.10619 2.02813 8.72206C3.13813 6.91706 5.65063 3.87956 9.9998 3.87956C14.349 3.87956 16.8615 6.91372 17.9715 8.72206C18.2089 9.10619 18.3346 9.54883 18.3346 10.0004C18.3346 10.452 18.2089 10.8946 17.9715 11.2787Z"
                      fill="#0B1332"
                    />
                    <path
                      d="M9.99968 5.83301C9.17559 5.83301 8.37001 6.07738 7.6848 6.53522C6.9996 6.99306 6.46554 7.6438 6.15018 8.40516C5.83481 9.16652 5.7523 10.0043 5.91307 10.8126C6.07384 11.6208 6.47068 12.3632 7.0534 12.946C7.63612 13.5287 8.37855 13.9255 9.1868 14.0863C9.99505 14.2471 10.8328 14.1645 11.5942 13.8492C12.3555 13.5338 13.0063 12.9998 13.4641 12.3146C13.922 11.6293 14.1663 10.8238 14.1663 9.99967C14.165 8.89501 13.7256 7.83597 12.9445 7.05486C12.1634 6.27374 11.1043 5.83433 9.99968 5.83301ZM9.99968 12.4997C9.50522 12.4997 9.02187 12.3531 8.61075 12.0783C8.19963 11.8036 7.8792 11.4132 7.68998 10.9564C7.50076 10.4996 7.45125 9.9969 7.54771 9.51195C7.64418 9.027 7.88228 8.58154 8.23191 8.23191C8.58154 7.88228 9.027 7.64417 9.51195 7.54771C9.9969 7.45125 10.4996 7.50076 10.9564 7.68998C11.4132 7.87919 11.8036 8.19963 12.0784 8.61075C12.3531 9.02187 12.4997 9.50522 12.4997 9.99967C12.4997 10.6627 12.2363 11.2986 11.7674 11.7674C11.2986 12.2363 10.6627 12.4997 9.99968 12.4997Z"
                      fill="#0B1332"
                    />
                  </g>
                  <defs>
                    <clipPath id="clip0_9419_9487">
                      <rect width="20" height="20" fill="white" />
                    </clipPath>
                  </defs>
                </svg>
              </div>
            )}
          </div>
          <div className="login__item login__btn">
            <input disabled={!isValid} type="submit" value="Продолжить" />
          </div>
          <div className="login__item login__register">
            <span>Еще нет аккаунта?</span>
            <Link to="/register">Зарегистрироваться</Link>
          </div>
        </form>
      </div>
    </div>
  );
};
